# Aim
**Predicting survivals on titanic**

In [4]:
import pandas as pd
df = pd.read_csv(r'C:\Users\Admin\Desktop\codebasic\titanic_train.csv')
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [5]:
del df['PassengerId']
del df['Name']
del df['SibSp']
del df['Parch']
del df['Ticket']
del df['Cabin']
del df['Embarked']

In [6]:
df.head(2)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833

In [7]:
inputs = df.drop('Survived',axis=1)#independent var
target = df['Survived']#dependent var

In [25]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [26]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [10]:
inputs.head(3)

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250

In [11]:
from sklearn.preprocessing import LabelEncoder

In [12]:
#creating object
male = LabelEncoder()
female = LabelEncoder()

In [13]:
inputs.head(3)

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250

In [15]:
inputs =pd.get_dummies(inputs)
inputs.head()

   Pclass   Age     Fare  Sex_female  Sex_male
0       3  22.0   7.2500           0         1
1       1  38.0  71.2833           1         0
2       3  26.0   7.9250           1         0
3       1  35.0  53.1000           1         0
4       3  35.0   8.0500           0         1

# Model

In [28]:
from sklearn.model_selection import train_test_split

In [29]:
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [34]:
len(X_test)

179

In [30]:
from sklearn import tree

In [31]:
model = tree.DecisionTreeClassifier()

In [32]:
model.fit(inputs,target)

DecisionTreeClassifier()

In [35]:
model.fit(inputs,target)

DecisionTreeClassifier()

In [36]:
model.score(inputs,target)

0.9797979797979798

In [37]:
model.predict([[3,22.0,7.2500,0,1]])

array([0], dtype=int64)

In [39]:
model.predict([[3,35.0,8.0500,0,1]])

array([0], dtype=int64)

In [41]:
model.predict([[1,38.0,71.2833,1,0]])

array([1], dtype=int64)

In [40]:
df.head(5)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500